app/Models/UsuarioModel.php

    public function list(){
        return $this->findAll();
---
SELECT *
FROM `Usuario`
WHERE `Usuario`.`deleted_at` IS NULL